In [408]:
import numpy as np
import pandas as pd

In [409]:
d = {
       "apples": pd.Series([3, 2, 0,1]),
        "oranges": pd.Series([0, 3, 7, 2]),
    }

df=pd.DataFrame(d)

In [410]:
df

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [411]:
mask=df['apples']>2
df.loc[mask,'apples']='fruit2'
#df['apples'][df['apples']>2]='fruit2'

In [412]:
df.iloc[1,0]='fancy'
df

   apples  oranges
0  fruit2        0
1   fancy        3
2       0        7
3       1        2

In [413]:
df['apples']=list(map(lambda x: x[0:-1] if type(x)==str else x,df['apples']))
df

  apples  oranges
0  fruit        0
1   fanc        3
2      0        7
3      1        2

In [414]:
df

  apples  oranges
0  fruit        0
1   fanc        3
2      0        7
3      1        2

In [415]:
df

  apples  oranges
0  fruit        0
1   fanc        3
2      0        7
3      1        2

In [416]:
df.rename(columns={"apples":"newname"},inplace=True)

In [417]:
df

  newname  oranges
0   fruit        0
1    fanc        3
2       0        7
3       1        2

In [418]:
old=[1,2,3]
new=[4,5,6]
df.replace(dict(zip(old,new)),inplace=True)
df

  newname  oranges
0   fruit        0
1    fanc        6
2       0        7
3       4        5

In [427]:
def tester(x):
    if type(x)!=str:
        return x+1
    else:
        return str(x)


df['newname']=list(map(lambda x:tester(x),df['newname']))
df

  newname  oranges
0   fruit        0
1    fanc        6
2       9        7
3      13        5